#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

[command]/home/runner/work/_temp/0671d8b1-77e6-4837-a33c-d2845eaede39/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-iQxYdK8R5aK9TBh6

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_code_server will be created
  + resource "github_repository" "quarkus_code_server" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Allow to have access to code-server from Dev UI"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + homepage_url                = "https://github.com/coder/code-server"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-code-server"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "quarkus-extension",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

  # github_repository.quarkus_langchain4j will be updated in-place
  ~ resource "github_repository" "quarkus_langchain4j" {
      - homepage_url                = "https://docs.quarkiverse.io/quarkus-langchain4j/dev/index.html" -> null
        id                          = "quarkus-langchain4j"
        name                        = "quarkus-langchain4j"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_qute_server_pages will be updated in-place
  ~ resource "github_repository" "quarkus_qute_server_pages" {
      ~ description                 = "Serves Qute templates directly over HTTP." -> "Automatically expose Qute templates via HTTP"
        id                          = "quarkus-qute-web"
        name                        = "quarkus-qute-web"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_web_assets will be updated in-place
  ~ resource "github_repository" "quarkus_web_assets" {
      - has_discussions             = true -> null
        id                          = "quarkus-web-bundler"
        name                        = "quarkus-web-bundler"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_wiremock will be updated in-place
  ~ resource "github_repository" "quarkus_wiremock" {
      ~ description                 = "Quarkus extension for launching an in-process WireMock server" -> "Quarkus extension for launching an in-process Wiremock server"
        id                          = "quarkus-wiremock"
        name                        = "quarkus-wiremock"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_team.quarkus_code_server will be created
  + resource "github_team" "quarkus_code_server" {
      + create_default_maintainer = false
      + description               = "code-server team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-code-server"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_code_server["maxandersen"] will be created
  + resource "github_team_membership" "quarkus_code_server" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "maxandersen"
    }

  # github_team_membership.quarkus_hivemq_client["codepitbull"] will be created
  + resource "github_team_membership" "quarkus_hivemq_client" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4651319"
      + username = "codepitbull"
    }

  # github_team_membership.quarkus_univocity_parsers["aruffie"] will be created
  + resource "github_team_membership" "quarkus_univocity_parsers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4707008"
      + username = "aruffie"
    }

  # github_team_repository.quarkus_code_server will be created
  + resource "github_team_repository" "quarkus_code_server" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-code-server"
      + team_id    = (known after apply)
    }

Plan: 6 to add, 4 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0
```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*